<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>Карамельная фабрика</title>
	<link rel="stylesheet" href="../order/calendar4/main.css">
</head>
<body>
	<p style="position: absolute;top: 50%;margin: 0;margin-top: -110px;left: 20%;width: 60%;box-sizing: border-box;">
		Дорогие друзья ждём вас в гости на нашей карамельной фабрике.
		<br>Если вы приехали пораньше вы можете попить с детишками чаю в ресторане Усадьбы на первом этаже. 
		<br><b>Одевайтесь потеплее</b>, так как встреча и часть нашего действа проходит на улице. 
		<br>
		<br>Адрес: Московская область Одинцовский район село Ромашково улица советская 14 а. 
		<br>Как добраться: От метро молодёжная маршрутка 795 20 минут до остановки платформа ромашково. 
		<br>
		<br>На территории усадьбы есть бесплатная парковка. 
		<br>Приезжайте за 10 – 15 минут до начала программы. 
		<br>
		<br>В случае необходимости звоните нам по телефону 8 499 938 4700
	</p>
</body>
</html>